[
	{
        "question": "It’s a 5 vs 5 battle. Both sides are charging towards each other! As you are nearing the enemy, what do you do?",
        "choices_and_roles": [
            [
                "Charge in and strike as fast and hard as I can", 
                "attacker"
            ],
            [
                "Get in front of my team and set up defenses to minimize damage to comrades", 
                "defender"
            ],
            [
                "Stay closely behind or side-by-side with teammates at all times to provide consistent ample support (e.g. healing, buffs, or debuffing opponent",
                "support"
            ],
            [
                "Wait and help attack whoever your teammates are attacking",
                "all-rounder"
            ]
        ]
	},
    {
        "question": "The team battle just started. What do you do?",
        "choices_and_roles": [
            [
                "Farm to level up as fast as I can, so I can do lots of damage and potentially snowball the entire game",
                "attacker"
            ],
            [
                "Level up when I can, but mainly provide, to others and myself, healing and buffs to sustain survival/health and facilitate attacking, farming, and leveling",
                "support"

            ],
            [
                "Focus on doing all three: leveling, protecting, and supporting my teammates",
                "all-arounder"
            ],
            [
                "Level up when I can, but mainly be on the lookout for enemies and protect my teammates when needed",
                "defender"
            ]
        ]
    },
    {
        "question": "How would you describe yourself in real life out of these options?",
        "choices_and_roles": [
            [
                "I have no preference in leading, assisting, and supporting. I fill in whatever is needed of me.",
                "all-rounder"
            ],
            [
                "I prefer to assist and support others. I take the lead if I need to, but it’s not my ideal.",
                "defender",
                "supporter"
            ],
            [
                "I prefer to take the lead, but will assist and support as needed",
                "attacker"
            ]
        ]
    },
    {
        "question": "If you had to choose one, which would you pick?",
        "choices_and_roles": [
            [
                "High survivability with healing/buff/debuff capabilities, low-to-mid damage resistance, low-to-slightly below mid damage output",
                "supporter"
            ],
            [
                "Mid damage output, damage resistance, and healing/buff/debuff capabilities",
                "all-rounder"
            ],
            [
                "High damage output, low-to-mid damage resistance",
                "attacker"
            ],
            [
                "High damage resistance, mid damage output",
                "defender"
            ]
        ]
    },
    {
        "question": "How would you rate your risk tolerance?",
        "choices_and_roles": [
            [
                "Low",
                "supporter"
            ],
            [
                "Between low and mid",
                "defender",
                "supporter"
            ],
            [
                "Mid",
                "all-rounder"
            ],
            [
                "Between medium and high",
                "all-rounder",
                "attacker"
            ],
            [
                "High",
                "attacker"
            ]
        ]
    },
    {
        "question": "Are you often the one who initiates asking others if they want to hang out?",
        "choices_and_roles": [
            [
                "I’m usually asking others if they want to hang out first.",
                "attacker"
            ],
            [
                "Half-half",
                "all-rounder"
            ],
            [
                "I don’t usually ask people if they want to hang out first. I’m often more involved with the plan-making process of the hangout (e.g. providing suggestions on what to do, where to go, etc. and thoughts/opinions)",
                "supporter"
            ],
            [
                "I don’t usually ask people if they want to hang out first. I might provide hangout suggestions here and there, but I usually just go with whatever my friends/family decide to do.",
                "defender"
            ]
        ]
    }
]